{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Anthony Ha", "title": "Video news startup Stringr raises $5.75M from Thomson Reuters and others", "description": "Stringr, a video-focused startup that says it can help news organizations adapt to the challenges of COVID-19, is announcing that it’s raised $5.75 million in new funding. When I wrote about the the company at the end of 2015, it was creating a marketplace th…", "url": "https://techcrunch.com/2020/05/28/stringer-thomson-reuters-funding/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/05/STRINGR_STILL_02.jpg?w=711", "publishedAt": "2020-05-28T13:12:03Z", "content": "Stringr, a video-focused startup that says it can help news organizations adapt to the challenges of COVID-19, is announcing that it’s raised $5.75 million in new funding.\r\nWhen I wrote about the the… [+2063 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kirsten Korosec", "title": "Nuro's self-driving vehicles to delivery prescriptions for CVS Pharmacy", "description": "Nuro, the autonomous robotics startup that has raised more than $1 billion from Softbank Vision Fund, Greylock and other investors, said Thursday it will test prescription delivery in Houston through a partnership with CVS Pharmacy. The pilot, which will use …", "url": "https://techcrunch.com/2020/05/28/nuros-self-driving-vehicles-to-delivery-prescriptions-for-cvs-pharmacy/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/05/Nuro-CVS.jpg?w=600", "publishedAt": "2020-05-28T13:00:54Z", "content": "Nuro, the autonomous robotics startup that has raised more than $1 billion from Softbank Vision Fund, Greylock and other investors, said Thursday it will test prescription delivery in Houston through… [+3039 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Mascarenhas", "title": "Stackin' raises $12.6M Series B to help millennials navigate the crowded fintech space", "description": "Fintech’s funding boom for the past decade has led to a flurry of new consumer startups tackling a wide range of money-related issues, from saving apps to investing platforms. Should you download Robinhood, Stash, Public, Acorns, or Truebill? The fintech craz…", "url": "https://techcrunch.com/2020/05/28/stackin-raises-12-6-series-b-to-help-millennials-navigate-the-crowded-fintech-space/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/04/GettyImages-684115968.jpg?w=599", "publishedAt": "2020-05-28T13:00:40Z", "content": "Fintechs funding boom for the past decade has led to a flurry of new consumer startups tackling a wide range of money-related issues, from saving apps to investing platforms.\r\nShould you download Rob… [+4197 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ingrid Lunden", "title": "Italy's Commerce Layer raises $6M led by Benchmark for its headless e-commerce platform", "description": "In the world of commerce, the last few months have underscored the fact that every retailer, brand and entity that sells or distributes something needs to have a digital strategy. Today, one of the startups that’s built a platform aimed at giving them more co…", "url": "https://techcrunch.com/2020/05/28/italys-commerce-layer-raises-6m-led-by-benchmark-for-its-headless-e-commerce-platform/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/05/Screenshot-2020-05-28-at-12.22.48.png?w=732", "publishedAt": "2020-05-28T13:00:28Z", "content": "In the world of commerce, the last few months have underscored the fact that every retailer, brand and entity that sells or distributes something needs to have a digital strategy. Today, one of the s… [+6083 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ron Miller", "title": "Wasabi announces $30M in debt financing as cloud storage business continues to grow", "description": "We may be in the thick of a pandemic with all of the economic fallout that comes from that, but certain aspects of technology don’t change no matter the external factors. Storage is one of them. In fact, we are generating more digital stuff than ever, and Was…", "url": "https://techcrunch.com/2020/05/28/wasabi-announces-30m-in-debt-financing-as-cloud-storage-business-continues-to-grow/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/05/GettyImages-667002442.jpg?w=609", "publishedAt": "2020-05-28T12:36:31Z", "content": "We may be in the thick of a pandemic with all of the economic fallout that comes from that, but certain aspects of technology don’t change no matter the external factors. Storage is one of them. In f… [+2535 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Jonathan Shieber", "title": "Providing card services to fintech companies around the world gives Marqeta a $4.3 billion valuation", "description": "This could have been Marqeta’s year to list as a public company on a major American stock exchange. The company, while still unprofitable, is a darling of the financial services sector and only last year reached a $2 billion valuation on the back of a $260 mi…", "url": "https://techcrunch.com/2020/05/28/providing-card-services-to-fintech-companies-around-the-world-gives-marqeta-a-4-3-billion-valuation/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/05/gettyimages-173291618-1.jpg?w=740", "publishedAt": "2020-05-28T11:30:52Z", "content": "This could have been Marqeta’s year to list as a public company on a major American stock exchange.\r\nThe company, while still unprofitable, is a darling of the financial services sector and only last… [+4297 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "Google and Microsoft reportedly considering stakes in Indian telecom firms after Facebook deal", "description": "Weeks after Facebook acquired a 9.9% stake in India’s Reliance Jio Platforms, two more American firms are reportedly interested in the Indian telecom market. Google is considering buying a stake of about 5% in Vodafone Idea, the second largest telecom operato…", "url": "https://techcrunch.com/2020/05/28/google-vodafone-idea-microsoft-reliance-jio-platforms-facebook-deal/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/11/GettyImages-501589428.jpg?w=655", "publishedAt": "2020-05-28T11:28:58Z", "content": "Weeks after Facebook acquired a 9.9% stake in India’s Reliance Jio Platforms, two more American firms are reportedly interested in the Indian telecom market.\r\nGoogle is considering buying a stake of … [+2390 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Catherine Shu", "title": "Gogoro unveils Eeyo, its new ebike brand", "description": "Gogoro, the mobility company best known for its SmartScooters, revealed details about its new ebike brand Eeyo today. Eeyo will launch with two lightweight models, both powered by the SmartWheel, a self-contained hub designed by the company that integrates mo…", "url": "https://techcrunch.com/2020/05/28/gogoro-unveils-eeyo-its-new-ebike-brand/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/05/3.-Eeyo-1-Group-Ride-Shot.jpg?w=600", "publishedAt": "2020-05-28T11:00:32Z", "content": "Gogoro, the mobility company best known for its SmartScooters, revealed details about its new ebike brand Eeyo today. Eeyo will launch with two lightweight models, both powered by the SmartWheel, a s… [+5248 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Lomas", "title": "EQT acquires freemium graphics and stock photo marketplace, Freepik", "description": "Freepik, a Malaga-Spain based website which offers a curated freemium marketplace of vector graphics and stock photos fed by a community of contributing designers and photographers, is being acquired by investment and private equity firm EQT. The EQT Mid Mark…", "url": "https://techcrunch.com/2020/05/28/eqt-acquires-freemium-graphics-and-stock-photo-marketplace-freepik/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/05/2902348.jpg?w=600", "publishedAt": "2020-05-28T10:49:08Z", "content": "Freepik, a Malaga-Spain based website which offers a curated freemium marketplace of vector graphics and stock photos fed by a community of contributing designers and photographers, is being acquired… [+3479 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Mike Butcher", "title": "A 12 year journey ends as Skimlinks is acquired by retail marketing platform Connexity", "description": "Connexity, a lead-gen platform for online retailers, has acquired Skimlinks, a UK platform for publishers to make money through affiliate links. Terms of the deal were undisclosed. According to Crunchbase, Skimlinks had raised a total of $25.5M and reached a …", "url": "https://techcrunch.com/2020/05/28/a-12-year-journey-ends-as-skimlinks-is-acquired-by-retail-marketing-platform-connexity/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/04/sklimlinks-image-by-dan-taylor-danheisenbergmedia-com-16.jpg?w=600", "publishedAt": "2020-05-28T10:09:07Z", "content": "Connexity, a lead-gen platform for online retailers, has acquired Skimlinks, a UK platform for publishers to make money through affiliate links. Terms of the deal were undisclosed. According to Crunc… [+3116 chars]"}]}